cases/VolumeAreaVerification/VolumeAreaVerification0.5/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
300000
(
-1.43925
-1.43925
-1.43925
-1.43925
-1.43925
-1.43925
-1.43925
-1.43925
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
2000
(
-1.43925
-1.43925
-1.43925
-1.43925
-1.43925
-1.43925
-1.43925
-1.43925
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
2000
(
-1.43925
-1.43925
-1.43925
-1.43925
-1.43925
-1.43925
-1.43925
-1.43925
...
)
;
    }
    boundaries
    {
        type            calculated;
        value           nonuniform List<scalar> 
36000
(
-1.43925
-1.28775
-1.13625
-0.98475
-0.83325
-0.68175
-0.53025
-0.37875
...
)
;
    }
}


// ************************************************************************* //
