cases/VolumeAreaVerification/VolumeAreaVerification0.5/system/fvOptions
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	fvOptions;
}porosityInzone0
{
	active	true;
	type	explicitPorositySource;
	explicitPorositySourceCoeffs
	{
		type	DarcyForchheimer;
		DarcyForchheimerCoeffs
		{
			d	(0.0 0.0 0.0);
			f	(1.470099e+00 4.308910e-01 4.308910e-01);
			coordinateSystem
			{
				type	cartesian;
				origin	(0.0 0.0 0.0);
				coordinateRotation
				{
					type	axesRotation;
					e1	( -1.000000e+00 0.000000e+00 0.000000e+00 );
					e2	( 0.000000e+00 1.000000e+00 0.000000e+00 );
				}
			}
			rho	rho;
			mu	mu;
		}
		selectionMode	cellZone;
		cellZone	zone0;
	}
}
porosityInzone1
{
	active	true;
	type	explicitPorositySource;
	explicitPorositySourceCoeffs
	{
		type	DarcyForchheimer;
		DarcyForchheimerCoeffs
		{
			d	(0.0 0.0 0.0);
			f	(1.166569e+00 3.419254e-01 3.419254e-01);
			coordinateSystem
			{
				type	cartesian;
				origin	(0.0 0.0 0.0);
				coordinateRotation
				{
					type	axesRotation;
					e1	( -1.000000e+00 0.000000e+00 -1.000000e+00 );
					e2	( 0.000000e+00 1.000000e+00 0.000000e+00 );
				}
			}
			rho	rho;
			mu	mu;
		}
		selectionMode	cellZone;
		cellZone	zone1;
	}
}
porosityInzone2
{
	active	true;
	type	explicitPorositySource;
	explicitPorositySourceCoeffs
	{
		type	DarcyForchheimer;
		DarcyForchheimerCoeffs
		{
			d	(0.0 0.0 0.0);
			f	(1.372092e+00 4.021649e-01 4.021649e-01);
			coordinateSystem
			{
				type	cartesian;
				origin	(0.0 0.0 0.0);
				coordinateRotation
				{
					type	axesRotation;
					e1	( 0.000000e+00 0.000000e+00 -1.000000e+00 );
					e2	( 0.000000e+00 1.000000e+00 0.000000e+00 );
				}
			}
			rho	rho;
			mu	mu;
		}
		selectionMode	cellZone;
		cellZone	zone2;
	}
}
